app/views/carts/_cart.html.erb

SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = 6
SELECT COUNT(*) FROM "line_items" WHERE "line_items"."cart_id" = 6
---
<%= hidden_div_if(@cart.line_items.empty?, id: 'cart') do %>