app/controllers/carts_controller.rb

  def create
    @cart = Cart.new(params[:cart])

    respond_to do |format|
      if @cart.save
---
INSERT INTO "carts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", Wed, 25 Sep 2013 10:43:21 UTC +00:00], ["updated_at", Wed, 25 Sep 2013 10:43:21 UTC +00:00]]