app/controllers/line_items_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", "4"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", Wed, 25 Sep 2013 09:43:19 UTC +00:00], ["updated_at", Wed, 25 Sep 2013 09:43:19 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "order_id", "product_id", "quantity", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["cart_id", 55], ["created_at", Thu, 26 Sep 2013 09:47:10 UTC +00:00], ["order_id", nil], ["product_id", 5], ["quantity", 1], ["updated_at", Thu, 26 Sep 2013 09:47:10 UTC +00:00]]
UPDATE "line_items" SET "quantity" = 2, "updated_at" = '2013-09-25 09:43:25.919782' WHERE "line_items"."id" = 1
---
  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)
    session[:counter] = nil

    respond_to do |format|
      if @line_item.save

SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = $1 LIMIT 1  [["id", "5"]]
UPDATE "line_items" SET "quantity" = 3, "updated_at" = '2013-09-26 05:40:17.242965' WHERE "line_items"."id" = 125
DELETE FROM "line_items" WHERE "line_items"."id" = $1  [["id", 5]]
---
  def destroy
    @cart = current_cart
    @line_item = LineItem.find(params[:id])
    @line_item = @cart.minus_product(@line_item.product_id)

    respond_to do |format|
      if (@line_item.quantity != 0)
        @line_item.save
      else
        @line_item.destroy