app/controllers/store_controller.rb

  def index
    if session[:counter].nil?
      session[:counter] = 1
    else
      session[:counter] = session[:counter] + 1
    end
    @counter = session[:counter]
    @products = Product.order(:title)
---
SELECT "products".* FROM "products" ORDER BY title